package com.inosovskyi.app.homework.lesson13;

public class HomeTask {
    /*
    оздать раннеры для каждого ДЗ. Создать меню для запуска каждого пункта из каждого ДЗ.
    Все раннеры назвать как Lesson{номер домашней работы}Runner и поместить в package runners.homework.

Написать класс Human который имеет только один конструктор (конструктор должен быть с параметрами,
принимающий на входе возраст и имя человека).
Поля возраст и имя должны быть приватными, а в классе должны быть реализованы геттеры getName(), getAge() и сеттер setAge (int age)
 который проверяет что возраст человека находится в диапазоне 1..120 лет, и в зависимости от этого выводит сообщение
 “New age setted” и сохраняет значение в поле возраста, или выводит сообщение “Age invalid” (если возраст не входит в диапазон).
     */
}
