package com.inosovskyi.app.homework.lesson12;

public class HomeTasks {

    /*
    Реализовать чтение из файла строк с массивами чисел,
    разделенными запятыми, и их сортировку с последующей записью в другой файл.
    Для чтения файла и записи в файл создать вспомогательные классы и/или методы.

Реализовать программу, которая считывает из файла список слов в стобик, \
и выводит в другой файл список слов и признак полиндромности в виде “moom is polindrome”.

Реализовать программу, которая при запуске запрашивает у пользователя имя файла и затем запрашивает у пользователя текст,
 считывая его построчно с консоли и сохраняя в файл. При вводе комбинации символов *exit* программа сохраняет все
 введенные строки в файл и завершает свою работу.

***Написать программу, которая создает properties file и считывает с консоли данные,
введенные пользователем в формате ключ и его значение, разделенное запятой. Например “dbname, localhost”.
При вводе пустой строки - программа сохраняет все данные в файл и затем выводит ключи и значения c разделителем в виде “=”,
 например “dbname=localhost”. Более подробно - https://www.mkyong.com/java/java-properties-file-examples/.
 ОБРАТИТЕ ваше внимание на то, что ключи не должны дублироваться: если пользователь ввел новое значение для уже ранее
  введенного ключа - то старое значение ключа следует заменить новым.

Создать раннеры для каждого ДЗ. Создать меню для запуска каждого пункта из каждого ДЗ.
Все раннеры назвать как Hometask{номер домашней работы} и поместить в package runners.

     */
}
